package practise;

/**
 * 面向对象第一天
 *
 */


public class Mianxiangduixiang {
}
/*
1方法第签名：方法名+参数列表
2方法的重载（overload）-----简化用户的调用
 1）发生在同一类中，方法名相同，参数列表不同，方法体不同
 2）编译器在编译时会根据方法的签名来自动绑定调用的方法
 3.构造方法：构造函数、构造器----复用给成员变量复制的代码
 1）给成员变量赋初值
 2)与类同名，没有返回值类型（连void都没有）
 3）在创建new对象时被自动调用
 4）若自己不写构造方法，则编译器默认提供一个无参构造，
 若自己写了构造方法，则不再默认提供一个无参构造
 5）构造方法可以重载
 4、this成员变量名------访问成员变量
                          -------当成员变量与局部变量同名时this不能省略
  1）this.方法名（）------调用方法（一般很少用）
  2）this（）------调用构造方法（一般很少用
 5、null：表示，没有指向任何对象
 若引用的值为null，则该引用不能再进行任何点操作了
 若操作则发生NullPointException空指针异常

 */


/**
 *2、继承：
 * 1）作用:代码复用
 * 2）通过extends来实现继承
 * 3）超类/父类：派生类所公用的属性和行为
 * 派生类/子类：派生类所特有的属性和行为
 */

/*
1、向上造型：
1）超类型的引用指向派生类的对象
2）能点出什么，看引用类型-----规定
2.方法的重写（Override）：
1）发生在父子类中，方法名相同，参数数列表，方法体不同
2）重写方法
 */

























